Revit 2025 API
ScrollbarVisibility Enumeration
 Lists all the visibility types of the scrollbar in the preview view.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum ScrollbarVisibility
Public Enumeration ScrollbarVisibility
public enum class ScrollbarVisibility
type ScrollbarVisibility
Members
Member name | Value | Description
None | 0 |  No scrollbars are visible.
Horizontal | 1 |  The horizontal scrollbar is visible.
Vertical | 2 |  The vertical scrollbar is visible.
Both | 3 |  The both scrollbars are visible.
See Also
Reference
Autodesk.Revit.UI Namespace